### Create a Pandas Series from the list [10, 20, 30, 40, 50]. Print the Series, its index, and data type. Then create a DataFrame with columns "Name", "Age", and "City" containing at least 4 rows of data.

In [14]:
import pandas as pd

df = pd.Series([10, 20, 30, 40, 50])
print(df)
print(df.index)
print(df.dtype)

data = {
    'Name': ['John', 'Alice', 'Bob', 'David'],
    'Age': [25, 30, 22, 28],
    'City': ['Dhaka', 'Chittagong', 'Sylhet', 'Khulna']
}

df2 = pd.DataFrame(data, columns=['Name', 'Age', 'City'], index=[1, 2, 3, 4])
df2

0    10
1    20
2    30
3    40
4    50
dtype: int64
RangeIndex(start=0, stop=5, step=1)
int64

    Name  Age        City
1   John   25       Dhaka
2  Alice   30  Chittagong
3    Bob   22      Sylhet
4  David   28      Khulna

### Using any DataFrame, write code to print the number of rows and columns, column data types (.dtypes), and summary statistics (.describe()).

In [23]:
print(df2.columns.size)
print(df2.index.size)
print(df2.describe())

3
4
         Age
count   4.00
mean   26.25
std     3.50
min    22.00
25%    24.25
50%    26.50
75%    28.50
max    30.00

### Create a DataFrame using the dictionary below:


#### data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
#### }

Print .columns, .index. Access a single column and one full row.

In [38]:
data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
}


dict_df = pd.DataFrame(data)
print(dict_df)
print(dict_df.columns)
print(dict_df.index)

print(dict_df['Product'])

print()

print(dict_df.loc[0])

  Product  Price  Quantity
0     Pen     10       100
1    Book     50        60
2  Eraser      5       200
3  Pencil      7       150
Index(['Product', 'Price', 'Quantity'], dtype='object')
RangeIndex(start=0, stop=4, step=1)
0       Pen
1      Book
2    Eraser
3    Pencil
Name: Product, dtype: object

Product     Pen
Price        10
Quantity    100
Name: 0, dtype: object

### Using .loc[] and .iloc[], show the first row, the second column, and a 2×2 block    from the middle of your DataFrame.

In [39]:
dict_df

  Product  Price  Quantity
0     Pen     10       100
1    Book     50        60
2  Eraser      5       200
3  Pencil      7       150

In [58]:
print(dict_df.loc[0])
print(dict_df.iloc[0])
print()

print(dict_df.loc[:, ['Price']])
print(dict_df.iloc[:, 1])

print()
print(dict_df.loc[1:2, ['Product', 'Price']])
print(dict_df.iloc[1:3, 0:2])

Product     Pen
Price        10
Quantity    100
Name: 0, dtype: object
Product     Pen
Price        10
Quantity    100
Name: 0, dtype: object

   Price
0     10
1     50
2      5
3      7
0    10
1    50
2     5
3     7
Name: Price, dtype: int64

  Product  Price
1    Book     50
2  Eraser      5
  Product  Price
1    Book     50
2  Eraser      5

### Create a 4×3 DataFrame of student names and marks. Drop one column using .drop(), drop one row by index

In [71]:
data = {
    'Student': ['Alice', 'Bob', 'Charlie', 'David'],
    'Math': [85, 90, 78, 88],
    'Science': [92, 85, 80, 89]
}

df = pd.DataFrame(data)
df.drop(1, inplace=True)
df.drop('Science', axis=1)

   Student  Math
0    Alice    85
2  Charlie    78
3    David    88

### Create a DataFrame of employees with columns "Name", "Department", and "Salary". Sort it by "Salary" in ascending order and by "Name" in descending order.

In [73]:
data = {
    'Name': ['John', 'Sarah', 'Michael', 'Emma'],
    'Department': ['HR', 'IT', 'Finance', 'Marketing'],
    'Salary': [40000, 55000, 60000, 45000]
}

df = pd.DataFrame(data)
copy_df = df.sort_values(['Salary', 'Name'], ascending=[1,0])
copy_df

      Name Department  Salary
0     John         HR   40000
3     Emma  Marketing   45000
1    Sarah         IT   55000
2  Michael    Finance   60000

### Create a DataFrame of 8 students with columns "Name" and "Score". Filter and print students with Score > 60 and those with Score < 40.

In [79]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emma', 'Frank', 'Grace', 'Hannah'],
    'Score': [40, 55, 60, 35, 50, 70, 65, 45]
}

df = pd.DataFrame(data)

arr = df[df['Score']<40]
print(arr)

print()

arr2 = df[df['Score']>40]
print(arr2)

    Name  Score
3  David     35

      Name  Score
1      Bob     55
2  Charlie     60
4     Emma     50
5    Frank     70
6    Grace     65
7   Hannah     45